export default {
  dashboard: {
    title: 'Панель приборов',
    charts: {
      customers: 'Клиенты',
      product: 'Прибыль от продукции',
      total: 'Всего заказов',
      refunds: 'Возвраты',
      crud: {
        add: 'Добавлять',
        delete: 'Удалить',
        random: 'Рандомизировать',
        reset: 'Перезагрузить',
      },
      series: {
        1: 'Клиенты',
        2: 'Продукты',
      },
      area: {
        title: 'Диаграмма площади',
      },
    },
    carousel: {
      conversionRate: {
        customers: 'Общий процент конверсии: 12 %',
        product: 'Общий процент конверсии: 37 %',
        total: 'Общий процент конверсии: 15 %',
        refunds: 'Общий процент конверсии: -9 %',
      },
      statistics: {
        title: 'Статистическая информация',
        daily: 'Ежедневно',
        weekly: 'Еженедельно',
        monthly: 'Ежемесячно',
        yearly: 'Ежегодно',
      },
    },
    calendar: {
      title: 'Календарь',
      week: {
        sun: 'Вс',
        mon: 'Пн',
        tue: 'Вт',
        wed: 'Ср',
        thu: 'Чт',
        fri: 'Пт',
        sat: 'Сб',
      },
      month: {
        1: 'Январь',
        2: 'Февраль',
        3: 'Март',
        4: 'Апрель',
        5: 'Май',
        6: 'Июнь',
        7: 'Июль',
        8: 'Август',
        9: 'Сентябрь',
        10: 'Октябрь',
        11: 'Ноябрь',
        12: 'Декабрь',
      },
    },
    disk: 'Дисковое пространство',
    todo: {
      title: 'Список дел',
      text: {
        1: 'Сходите на рынок за покупками.',
        2: 'Иди сегодня на работу и подготовь отчет.',
        3: 'Сходите в спортзал, чтобы заняться спортом.',
        4: 'Потратьте полчаса на чтение книги.',
        5: 'Найдите время полить цветы в саду.',
        6: 'Чтобы выучить новый язык, практикуйте его каждый день.',
        7: 'Уделите время своему хобби, например рисованию или музицированию.',
        8: 'Производство REACT TS MUI 5',
      },
    },
  },
}
