export default {
  skins: {
    title: "Темы",
    paletteString: `У нас есть настраиваемый массив для конфигурации стиля и цветов нашего проекта. Вы можете увидеть код ниже, и, если хотите, добавить новый объект и настроить основной цвет, вторичный цвет и другие детали.`,
    open: `Открыть`,
    modeString: `Не могли бы вы взглянуть внутрь файла src/layouts/rightSidebar/content/mode/content/Content.tsx? Там есть цикл forEach по массиву, и любые значения, которые вы добавите в массив myPrimaryMode в constants.ts, автоматически станут частью ваших выборов. Однако важно отметить, что добавление объектов в массив должно соответствовать требуемой структуре.`,
  },
};
