export default {
  support: {
    title: "Поддержка",
    here: "Здесь",
    intro: "Вступление",
    header: "Все вопросы можно отправлять через форму обратной связи",
    questions:
      "Я отвечаю на все вопросы в порядке их поступления в течение 24-48 часов, с понедельника по пятницу, с 8:00 до 18:00 (GMT+4) каждый день.",
    panic:
      "Пожалуйста, не паникуйте, если я долго не отвечаю - я люблю своих покупателей и отвечу на все вопросы :)",
    section_1: {
      title: "Поддержка моих товаров включает в себя:",
      li_1: "Ответы на вопросы о том, как использовать товар.",
      li_2: "Ответы на технические вопросы о товаре (и включенных сторонних активах).",
      li_3: "Помощь при дефектах товара или включенных сторонних активах.",
      li_4: "Обновления товара для обеспечения постоянной совместимости и устранения уязвимостей безопасности.",
    },
    section_2: {
      title: "Поддержка товара не включает в себя:",
      li_1: "Установка товара.",
      li_2: "Хостинг, серверное окружение или программное обеспечение.",
      li_3: "Поддержка сторонних плагинов.",
      li_4: "Интеграция плагинов.",
      li_5: "Поддержка проблем, вызванных изменениями пользователем в коде темы, стиле и общей функциональности.",
      more: "Более подробную информацию о условиях поддержки можно увидеть :",
    },
  },
};
